{
    "What breed is good for a small apartment?": "Breeds like the Cavalier King Charles Spaniel or Pomeranian are ideal for small spaces due to their compact size and adaptability.",
    "Which breed is best for families with children?": "Golden Retrievers, Labrador Retrievers, and Beagles are excellent for families due to their friendly, patient, and social nature.",
    "Are there breeds that don't shed much?": "Hypoallergenic breeds like the Bichon Frise, Poodle, or Shih Tzu shed minimally, making them great for allergy sufferers.",
    "What breed is suitable for someone with allergies?": "Breeds with low dander production, such as the French Bulldog or Pug, are often better for allergy-prone individuals.",
    "What breed is good for first-time owners?": "The Border Collie or German Shepherd are recommended for first-time owners due to their trainability and loyalty.",
    "What breed is best for active lifestyles?": "High-energy breeds like the Australian Shepherd or Siberian Husky thrive in active households with daily exercise.",
    "What breed is good for elderly owners?": "Small breeds like the Dachshund or Basset Hound are often suitable for seniors due to their lower energy needs.",
    "What breed is good for homes with other pets?": "Breeds like the Golden Retriever or Cocker Spaniel are typically social and can coexist with other animals.",
    "What breed is good for people with limited time?": "Low-energy breeds like the Basset Hound or Corgi are ideal for owners with busy schedules.",
    "What breed is good for people with allergies?": "See above (hypoallergenic breeds).",
    "What if I live in a city with limited space?": "Consider small breeds like the Shih Tzu or Pomeranian, which adapt well to urban living.",
    "What if I work long hours?": "Breeds like the Beagle or Basset Hound are independent and can handle being alone for short periods.",
    "What if I have a large yard?": "High-energy breeds like the German Shepherd or Border Collie will thrive with ample space to run.",
    "What if I have children?": "Choose a gentle breed like the Golden Retriever or Labrador Retriever for safe family interactions.",
    "What if I have other pets?": "Opt for a social breed like the Cocker Spaniel or Poodle that can coexist with cats or other dogs.",
    "What if I have allergies?": "See above (hypoallergenic breeds).",
    "What should I expect during teething?": "Puppies (3-6 months) may chew aggressively, drool excessively, and lose baby teeth. Provide safe chew toys.",
    "How to manage chewing behavior in puppies?": "Use durable chew toys, avoid giving bones, and supervise playtime to prevent destructive chewing.",
    "What are common issues during adolescence?": "Teenage dogs (6-18 months) may exhibit rebellious behavior, excessive barking, or separation anxiety. Consistent training is key.",
    "What are the costs of end-of-life care for dogs?": "End-of-life costs include vet visits ($500–$2,000+), hospice care ($200–$500/day), and medications (varies by condition).",
    "What are the costs of vet visits for elderly dogs?": "Annual checkups cost $100–$500, with additional costs for geriatric care (e.g., joint supplements, mobility aids).",
    "What are the costs of dog food for senior dogs?": "Senior dog food can cost $20–$60/month depending on size and brand, with premium options costing more.",
    "What are the costs of end-of-life euthanasia?": "Euthanasia typically costs $500–$1,500, depending on location and veterinary clinic.",
    "What are the costs of pet insurance for older dogs?": "Senior dog insurance can cost $20–$100/month, covering chronic conditions like arthritis or kidney disease.",
    "What are the costs of hospice care for dogs?": "Hospice care averages $200–$500/day, covering pain management and comfort-focused treatment.",
    "What are the costs of dog grooming for senior dogs?": "Grooming costs $50–$200/month, with additional costs for medical grooming (e.g., shaving for cancerous growths).",
    "What are the costs of dog training classes?": "Basic obedience classes cost $100–$300/month, with specialized training (e.g., service dog training) costing more.",
    "What are the costs of dog boarding?": "Boarding costs $20–$60/day, with additional fees for special needs (e.g., medication, dietary restrictions).",
    "What are the costs of dog daycare?": "Daycare costs $30–$80/day, depending on location and facilities.",
    "What are the costs of dog walking services?": "Walking services cost $15–$30/day, with premium options (e.g., senior walks) costing more.",
    "What are the costs of dog toys and accessories?": "Toys cost $5–$50 each, with high-quality items (e.g., squeaky toys) costing more.",
    "What are the costs of dog food for puppies?": "Puppy food costs $20–$60/month, with premium brands costing more.",
    "What are the costs of dog food for senior dogs?": "See above (senior dog food costs).",
    "What are the costs of dog food for large breeds?": "Large breed food costs $30–$80/month, with higher costs for specialized diets (e.g., joint support).",
    "What are the costs of dog food for small breeds?": "Small breed food costs $20–$50/month, with premium options costing more.",
    "What are the costs of dog food for working dogs?": "High-protein diets for working dogs can cost $40–$100/month, depending on activity level.",
    "What are the costs of vet visits for puppies?": "Puppy checkups cost $50–$200 per visit, with additional costs for vaccinations and deworming.",
    "What are the costs of vet visits for adult dogs?": "Annual checkups cost $100–$500, with additional costs for vaccinations and parasite prevention.",
    "What are the costs of vet visits for senior dogs?": "See above (geriatric care costs).",
    "What are the costs of emergency vet care?": "Emergency visits can cost $500–$5,000+, depending on the issue (e.g., surgery, poisoning).",
    "What are the costs of pet cremation?": "Cremation costs $100–$500, with options for private or communal cremation.",
    "What are the costs of pet burial?": "Burial costs vary by location, with some areas requiring permits or special cemeteries.",
    "What are the costs of pet memorial services?": "Memorial services cost $50–$500+, depending on the provider and services chosen.",
    "What are the costs of pet insurance for puppies?": "Puppy insurance costs $20–$100/month, covering accidents and illnesses.",
    "What are the costs of pet insurance for senior dogs?": "See above (senior dog insurance costs).",
    "What are the costs of pet insurance for working dogs?": "Working dog insurance can cost $50–$200/month, covering specialized care and injuries.",
    "What are the costs of caring for a large breed dog?": "Large breeds require higher food costs ($30–$80/month), more frequent vet visits, and joint supplements.",
    "What are the costs of caring for a small breed dog?": "Small breeds have lower food costs ($20–$50/month) but may require more frequent vet visits for health issues.",
    "What are the costs of caring for a purebred dog?": "Purebreds may have higher vet costs due to genetic conditions, with some breeds requiring specialized care.",
    "What are the costs of caring for a mixed-breed dog?": "Mixed breeds often have lower health risks but may still require routine vet care and vaccinations.",
    "What are the costs of caring for a rescue dog?": "Rescue dogs may need additional vet care, training, and behavioral support, costing $200–$1,000+ initially.",
    "What are the costs of caring for a shelter dog?": "Shelter dogs may require vaccinations, spaying/neutering, and behavioral assessments, costing $100–$500+.",
    "What are the costs of caring for a breeder dog?": "Breeder dogs may require specialized diets, health screenings, and breeding-related expenses.",
    "What are the costs of caring for a show dog?": "Show dogs require high-quality food, grooming, and training, costing $200–$1,000+ monthly.",
    "What are the costs of caring for a service dog?": "Service dogs require specialized training, equipment, and ongoing care, costing $500–$2,000+ monthly.",
    "What are the costs of caring for a therapy dog?": "Therapy dogs require regular training, vet care, and participation in programs, costing $200–$500+ monthly.",
    "What are the costs of dog ownership in the UK?": "Annual costs in the UK range from £1,500–£5,000+, including food, vet care, insurance, and toys.",
    "What are the costs of dog ownership in the US?": "Annual costs in the US range from $2,000–$6,000+, depending on location and breed.",
    "What are the costs of dog ownership in other countries?": "Costs vary by country, with higher prices in urban areas and for premium pet products.",
    "What are the costs of dog ownership for elderly owners?": "Elderly owners may need to budget for senior dog food, vet visits, and mobility aids, costing $200–$1,000+ monthly.",
    "What are the costs of dog ownership for working owners?": "Working owners may need to budget for dog walkers, boarding, and pet insurance, costing $100–$500+ monthly.",
    "What are the costs of dog ownership for families with children?": "Families may need to budget for toys, training classes, and vet visits, costing $200–$1,000+ monthly.",
    "What are the costs of dog ownership for people with allergies?": "Allergy-friendly breeds and hypoallergenic products may cost $200–$500+ monthly.",
    "What are the costs of dog ownership for people with limited space?": "Small breeds and compact living spaces may reduce costs, but vet visits and food still apply.",
    "What are the costs of dog ownership for people with limited time?": "Low-energy breeds and automated feeders may reduce costs, but vet care remains essential.",
    "What are the costs of dog ownership for people with limited budgets?": "Budget-friendly breeds, basic diets, and free adoption programs can reduce costs to $500–$1,000+ annually."
}